# Pandas

1. Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe.

In [8]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
from pandas.tseries.offsets import *

date_today = datetime.now()
days = pd.date_range(date_today, date_today + timedelta(365), freq='D')

np.random.seed(seed=1111)
data = np.random.randint(1, high=100, size=len(days))
df = pd.DataFrame({'test': days, 'col2': data})
df = df.set_index('test')
df.asfreq(BDay())

                            col2
test
2020-01-13 13:08:08.085109    56
2020-01-14 13:08:08.085109    82
2020-01-15 13:08:08.085109    13
2020-01-16 13:08:08.085109    35
2020-01-17 13:08:08.085109    53
...                          ...
2021-01-05 13:08:08.085109    47
2021-01-06 13:08:08.085109    93
2021-01-07 13:08:08.085109    47
2021-01-08 13:08:08.085109    90
2021-01-11 13:08:08.085109    51

[261 rows x 1 columns]

2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names.

In [20]:
height = pd.Series(data = [23,42,55],index = None)
weight = pd.Series(data = [71,32,48],index = None)
frame = {'height': height,'weight':weight}
df2 = pd.DataFrame(data = frame)
df2

   height  weight
0      23      71
1      42      32
2      55      48

How to get the items of series A not present in series B .From ser1 remove items present in ser2.

In [36]:
ser1 = pd.Series([2,3,4,5])
ser2 = pd.Series([5,6,7,8])
[ a for a in ser1 if a not in ser2 ]

[4, 5]

simple method

In [33]:
ser1[~ser1.isin(ser2)]

0    2
1    3
2    4
dtype: int64

# Questions on Titanic Dataset :-

Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [49]:
tit = pd.read_csv('titanic.csv')
print("Minimum age is :",min(tit.Age))
print("Maximum age is :",max(tit.Age))
tit.describe()['Age']

Minimum age is : 0.42
Maximum age is : 80.0

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

In [51]:
#We can get it by using value_counts() function
tit.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

 Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

In [53]:
tit.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [54]:
#method 1:
tit.Embarked.mask(tit.Embarked == "Q","O",inplace=False)

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    O
Name: Embarked, Length: 891, dtype: object

In [56]:
#method2:
import numpy as np
tit.Embarked = np.where((tit.Embarked == "Q"),"O",tit.Embarked)
tit

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,O

Bin the price column in titanic data set into 5 equal groups and get counts of each bin

In [73]:
tit1 = pd.cut(tit.Fare,bins=[0,50,150,300,550],labels = ["set1","set2","set3","set4"] )
tit1.value_counts()

set1    716
set2    131
set3     26
set4      3
Name: Fare, dtype: int64

Count the number of missing values in each column?

In [74]:
tit.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Get the row number of the 5th largest value in the Age column of titanic dataset?

In [94]:
tit['rank'] = tit.Age.rank(method = 'dense',ascending = False)
tit[tit['rank']==5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,rank
672,673,0,2,"Mitchell, Mr. Henry Michael",male,70.0,0,0,C.A. 24580,10.5,NaN,S,5.0
745,746,0,1,"Crosby, Capt. Edward Gifford",male,70.0,1,1,WE/P 5735,71.0,B22,S,5.0

Normalize all columns in a dataframe?

Get the indices of items of ser2 in ser1 as a list.

In [116]:
ser1 = pd.Series([10,9,6,5,3,1,12,8,13])
ser2 = pd.Series([1,3,10,13])
ser1[ser1.isin(ser2)].index

Int64Index([0, 4, 5, 8], dtype='int64')

 How to convert a series of date-strings to a timeseries?

In [122]:
s = pd.Series(['01 jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05T12:20'])
s1 = pd.to_datetime(s)
s1

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 12:20:00
dtype: datetime64[ns]

Get the day of month, week number, day of year and day of week from ser.

In [136]:
ser = pd.Series(['01 jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
ser = pd.to_datetime(ser)
ser_day = ser.dt.day
ser_week = ser.dt.week
ser_weekday = ser.dt.weekday
ser_doy = ser.dt.dayofyear
ser_doy

0      1
1     33
2     63
3     94
4    125
5    157
dtype: int64

How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

In [138]:
#method1:
df = pd.date_range('2000-01-01',periods =10,freq = "w")
df

DatetimeIndex(['2000-01-02', '2000-01-09', '2000-01-16', '2000-01-23',
               '2000-01-30', '2000-02-06', '2000-02-13', '2000-02-20',
               '2000-02-27', '2000-03-05'],
              dtype='datetime64[ns]', freq='W-SUN')

In [139]:
#method2:
df = pd.period_range('2000-01-01',periods =10,freq = "w")
df

PeriodIndex(['1999-12-27/2000-01-02', '2000-01-03/2000-01-09',
             '2000-01-10/2000-01-16', '2000-01-17/2000-01-23',
             '2000-01-24/2000-01-30', '2000-01-31/2000-02-06',
             '2000-02-07/2000-02-13', '2000-02-14/2000-02-20',
             '2000-02-21/2000-02-27', '2000-02-28/2000-03-05'],
            dtype='period[W-SUN]', freq='W-SUN')

Import every 50th row of BostonHousing dataset as a dataframe.

In [142]:
df = pd.read_csv('boston_house_price.csv', chunksize=50)
df2 = pd.DataFrame()
for chunk in df:
    df2 = df2.append(chunk.iloc[0,:])
df2

,AGE,B,CHAS,CRIM,DIS,INDUS,LSTAT,MEDV,NOX,PTRATIO,RAD,RM,TAX,ZN
0,65.2,396.90,0.0,0.00632,4.0900,2.31,4.98,24.0,0.538,15.3,1.0,6.575,296.0,18.0
50,45.7,395.56,0.0,0.08873,6.8147,5.64,13.45,19.7,0.439,16.8,4.0,5.963,243.0,21.0
100,79.9,394.76,0.0,0.14866,2.7778,8.56,9.42,27.5,0.520,20.9,5.0,6.727,384.0,0.0
150,97.3,372.80,0.0,1.65660,1.6180,19.58,14.10,21.5,0.871,14.7,5.0,6.122,403.0,0.0
200,13.9,384.30,0.0,0.01778,7.6534,1.47,4.45,32.9,0.403,17.0,3.0,7.135,402.0,95.0
250,13.0,396.28,0.0,0.14030,7.3967,5.86,5.90,24.4,0.431,19.1,7.0,6.487,330.0,22.0
300,47.4,390.86,0.0,0.04417,7.8278,2.24,6.07,24.8,0.400,14.8,5.0,6.871,358.0,70.0
350,44.4,396.90,0.0,0.06211,8.7921,1.25,5.98,22.9,0.429,19.7,1.0,6.490,335.0,40.0
400,100.0,396.90,0.0,25.04610,1.5888,18.10,26.77,5.6,0.693,20.2,24.0,5.987,666.0,0.0
450,92.6,0.32,0.0,6.71772,2.3236,18.10,17.44,13.4,0.713,20.2,24.0,6.749,666.0,0.0
500,79.7,396.90,0.0,0.22438,2.4982,9.69,14.33,16.8,0.585,19.2,6.0,6.027,391.0,0.0